In [1]:
import numpy as np
import pandas as pd

In [15]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'
chipo = pd.read_csv(url, sep='\t')
chipo

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

## ðŸŒŸExercise 1: Getting & Knowing Your Data (Chipo)

In [16]:
# Display the first 10 rows of 'chipo' using the head() function
chipo.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [19]:
# Determine the total number of entries (rows) in 'chipo' using shape or info()
total_entries = chipo.shape[0]
total_entries

4622

In [21]:
# Use shape or columns to find the total number of columns in 'chipo'
total_columns = chipo.shape[1]
total_columns

5

In [22]:
# Use columns to print all the column names
column_names = chipo.columns
column_names

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [23]:
# Utilize index to understand how the DataFrame is indexed
dataframe_index = chipo.index
dataframe_index

RangeIndex(start=0, stop=4622, step=1)

In [24]:
# Use the value_counts() method on the â€˜item_nameâ€™ column to find the most ordered item
most_ordered_item = chipo['item_name'].value_counts().idxmax()
most_ordered_item

'Chicken Bowl'

In [25]:
# Find the total number of items ordered by summing the â€˜quantityâ€™ column
total_items_ordered = chipo['quantity'].sum()
total_items_ordered

4972

In [26]:
# Use value_counts() on â€˜choice_descriptionâ€™ to find the most ordered item from this column
most_ordered_choice_description = chipo['choice_description'].value_counts().idxmax()
most_ordered_choice_description

'[Diet Coke]'

In [ ]:
# Convert â€˜item_priceâ€™ to a float datatype using apply() and lambda
chipo['item_price'] = chipo['item_price'].apply(lambda x: float(x.replace('$', '')))

In [30]:
# Calculate the total revenue for the dataset by summing the â€˜item_priceâ€™ column
total_revenue = chipo['item_price'].sum()
total_revenue

34500.16

In [31]:
# Find the total number of orders by using the nunique() function on the â€˜order_idâ€™ column
total_orders = chipo['order_id'].nunique()
total_orders

1834

In [32]:
# Compute the average order value by dividing the total revenue by the number of orders
average_order_value = total_revenue / total_orders
average_order_value

18.811428571428575

In [33]:
# Determine the total number of unique items sold using the nunique() function on the â€˜item_nameâ€™ column
total_unique_items_sold = chipo['item_name'].nunique()
total_unique_items_sold

50

## ðŸŒŸExercise 2: Filtering & Sorting (Chipo)

In [36]:
count_products_above_10 = chipo[chipo['item_price'] > 10]['item_name'].nunique()
count_products_above_10

31

## ðŸŒŸ Exercise 3: Grouping (Users)

In [44]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
users = pd.read_csv(url, sep='|')
mean_age_per_occupation = users.groupby('occupation')['age'].mean()
mean_age_per_occupation

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

## ðŸŒŸ Exercise 4: Merge (All_data, All_data_col, Data3)

In [45]:
data1 = pd.DataFrame({
    'ID': [1, 2, 3, 4, 5],
    'Name': ['Lana', 'Alice', 'Vik', 'Iva', 'Petr']
})
data1

   ID   Name
0   1   Lana
1   2  Alice
2   3    Vik
3   4    Iva
4   5   Petr

In [46]:
data2 = pd.DataFrame({
    'ID': [6, 7, 8, 9, 10],
    'Name': ['Lui', 'Alik', 'Vuf', 'Eva', 'Pite']
})
data2

   ID  Name
0   6   Lui
1   7  Alik
2   8   Vuf
3   9   Eva
4  10  Pite

In [48]:
data3 = pd.DataFrame({
    'ID': [101, 102, 103, 104, 105],
    'Score': np.random.randint(0, 101, 5)
})
data3

    ID  Score
0  101     21
1  102      0
2  103     22
3  104     78
4  105     90

In [49]:
all_data = pd.concat([data1, data3], ignore_index=True)
all_data

    ID   Name  Score
0    1   Lana    NaN
1    2  Alice    NaN
2    3    Vik    NaN
3    4    Iva    NaN
4    5   Petr    NaN
5  101    NaN   21.0
6  102    NaN    0.0
7  103    NaN   22.0
8  104    NaN   78.0
9  105    NaN   90.0

In [50]:
all_data_col = pd.concat([data1, data3], axis=1)
all_data_col

   ID   Name   ID  Score
0   1   Lana  101     21
1   2  Alice  102      0
2   3    Vik  103     22
3   4    Iva  104     78
4   5   Petr  105     90

## ðŸŒŸ Exercise 5: Deleting (Iris)